ci4/app/Views/home.php

SELECT *
FROM `artikel`
ORDER BY `created_at` DESC
 LIMIT 5
---
    <hr>
    <?php
        $model   = new App\Models\ArtikelModel();
        $artikel = $model->orderBy('created_at', 'DESC')->limit(5)->findAll();