ci4/app/Controllers/Post.php

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'   => $this->request->getVar('isi')
        ];
        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`, `created_at`) VALUES ('Judul artikel 10', 'Isi artikel ke 10', '2026-06-24 03:06:50')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();

        if ($data) {
            $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `id` = '3'
 LIMIT 1
DELETE FROM `artikel`
WHERE `id` IN ('3')