ci4/app/Controllers/Api/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
OR `useremail` = 'admin'
 LIMIT 1
---
    public function login()
    {
        try {
            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');

            if (empty($username) || empty($password)) {
                return $this->respond([
                    'status'   => 400,
                    'messages' => 'Username dan Password wajib diisi.'
                ], 400);
            }

            $model = new UserModel();

            $user = $model->where('username', $username)
                          ->orWhere('useremail', $username)
                          ->first();